---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisAdvanced
source: html/2bb6d1e8-e9c5-8e88-1409-e70e5c49094b.htm
---
# Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisAdvanced Property

Advanced.

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisAdvanced { get; }
```